var rand = (n) => {
    return Math.floor(Math.random() * n)
}

var res = ["林乾", "廣炒", "老建", "雲南小館", "萊爾富", "搭伙", "呷尚寶", "QBurger", 
    "建豆", "烤上台大", "福井", "彥亭", "四海", "金紅", "65", "煎台兄弟", "7-11", 
    "京席素食", "吉坤", "春天涼麵", "Ebisu大", "懿品小珍", "劉媽媽", "原味咖哩屋", 
    "黃龍莊", "牯嶺油飯", "豪季水餃", "圓環肉羹", "yuki", "金仙金牛王", "郝家食堂", 
    "Ebisu小", "福記廣式燒臘", "鬼匠拉麵", "四兩刈包", "建宏雞肉飯", "敲碗健康餐盒", 
    "曼鯊鯊", "便當王", "逸香麵線", "本味", "第一雞肉飯", "鬍鬚張", "豆味行", "涼夏麵", 
    "村民餐盒", "慢慢bistro", "吉士達義麵房", "三商巧福", "摩斯", "東門鴨莊", "阿助水餃", 
    "鐵路便當", "樂饕饕自助餐", "風神食堂"]

$(() => {

    $('#start').on('click', () => {

        var c = $('#c_n').val()
        var arr = []
        var str = ''
        var s = ''
        if(c <= 55){
            for (i = 1; i <= c; i++) {
                s = rand(55)
                var b = 1
                for(j=0;j<arr.length;j++){
                    if(arr[j]==s){
                        i--
                        b = 0
                    }
                }
                if(b){
                    str += res[s]
                    str += ' '
                    arr.push(s);
                }
            }
        }

        $('#op').val(str)
    })
})